In [1]:
import pandas as pd
import os
print(os.getcwd())

train = pd.read_csv('data/train.csv', index_col="PassengerId")
train.iloc[0:5,:]

c:\myjupyte_notebook

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
# **** <문제1> ****
# 타이타닉의 train데이터에서 Survived 컬럼의 평균을 구합니다.
# 그 결과를 survived_rate라는 이름의 변수에 저장합니다.


# survived_rate는 현재 0.0 ~ 1.0 사이의 값을 갖습니다.
# 하지만 퍼센티지(%)는 0 ~ 100.0 사이의 값을 가지므로, survived_rate에 100을 곱해줍니다.


# survived_rate를 출력합니다. 결과는 38.4%가 나와야 합니다.

survived_rate = train['Survived']
survived_rate = (sum(survived_rate) / len(survived_rate)) * 100
survived_rate = round(survived_rate, 1)
print(f'생존률은 = {survived_rate}%')

생존률은 = 38.4%

In [3]:
# **** <문제2> ****
# pandas의 value_counts를 활용하여 생존자의 총 인원수와 사망자의 총 인원수를 출력합니다.
# 생존자의 총 인원수(1)은 342명, 사망자의 총 인원수(0)는 549명이 나와야 합니다.

# 해당 컬럼의 값들을 group화 시켜서 count
train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [4]:
# **** <문제3> ****
# Survived 컬럼의 상위 5개의 값을 출력합니다.
# 결과값은 0과 1이 나오는데, Survived 컬럼에 대한 사전 설명(가령 0이 어떤 값을 나타내는지, 1이 어떤 값을 나타내는지)
# 을 듣지 않으면 이 값이 어떠한 의미를 가지는지 직관적으로 이해하기 어렵습니다.

train['Survived'].head()

PassengerId
1    0
2    1
3    1
4    1
5    0
Name: Survived, dtype: int64

In [5]:
# Survived(humanized)라는 새로운 컬럼 만들기
#이 컬럼에는 0(사망), 1(생존)이 아닌, Perish(사망), Survived(생존). 
#최종적으로는 다음의 결과가 나와야 합니다.
from IPython.display import HTML
HTML(filename="html/table1.html")

In [6]:
# **** <문제4> ****
# 먼저 Survived 컬럼이 0인 승객을 색인합니다. 이후 Survived(humanized)라는 이름의
# 새로운 컬럼을 만들어 여기에 Perish 라는 값을 넣습니다.

# 비슷하게 Survived 컬럼이 1인 승객을 찾아 Survived(humanized)에 Survived라는 값을 넣습니다.


# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.


# Survived 컬럼과 Survived(humanized) 컬럼 두 개를 상위 5개의 Row를 출력비교합니다.

import numpy as np

train['Survived(humanized)'] = np.where(train['Survived'] == 0, 'Perish', 'Survived')

train.loc[:, ['Survived', 'Survived(humanized)']].head()

             Survived Survived(humanized)
PassengerId
1                   0              Perish
2                   1            Survived
3                   1            Survived
4                   1            Survived
5                   0              Perish

In [7]:
# **** <문제5> ****
# pandas의 value_counts를 활용하여 생존자의 총 인원수와 사망자의 총 인원수를 출력합니다.
# 여기서 생존 여부는 Survived가 아닌 Survived(humanized) 컬럼을 사용합니다.
# 생존자의 총 인원수(Survived)은 342명, 사망자의 총 인원수(Perish)는 549명이 나와야 합니다.

train['Survived(humanized)'].value_counts()

Perish      549
Survived    342
Name: Survived(humanized), dtype: int64

In [8]:
# pandas의 pivot_table을 활용하여 Pclass별 생존률을 출력합니다.
# 여기서 Pclass값이 1, 2, 3이 나오는데, Pclass 컬럼에 대한 사전 설명을 듣지 않으면 이해하기 어렵습니다.
# 그러므로 Pclass값을 조금 더 직관적으로 바꿔준다면 pivot_table로 분석하기 편할 것입니다
pd.pivot_table(data=train, index="Pclass", values="Survived")

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

In [9]:
#이번에는 **Pclass(humanized)**라는 새로운 컬럼을 만들어주세요. 
#이 컬럼에는 1, 2, 3이 아닌 First Class, Business, Economy 라는 값을 넣습니다. 
#최종적으로는 다음의 결과가 나와야 합니다.

from IPython.display import HTML
HTML(filename="html/table2.html")

In [10]:
# **** <문제6> ****
# 먼저 Pclass 컬럼이 1인 승객을 색인합니다. 이후 Pclass(humanized)라는 이름의
# 새로운 컬럼을 만들어 여기에 "First Class" 라는 값을 넣습니다.

# 비슷하게 Pclass 컬럼이 2인 승객을 찾아 Pclass(humanized)에 "Business" 라는 값을 넣습니다.
# 비슷하게 Pclass 컬럼이 3인 승객을 찾아 Pclass(humanized)에 "Economy" 라는 값을 넣습니다.

# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
# Pclass 컬럼과 Pclass(humanized) 컬럼 두 개를 출력하여 비교합니다.
train['Pclass(humanized)'] = ''
grade_2 = np.where(train['Pclass'] == 2, 'Business', 'Economy')
train['Pclass(humanized)'] = np.where(train['Pclass'] == 1, 'First class', grade_2)

train.loc[:,['Pclass', 'Pclass(humanized)']].head()

             Pclass Pclass(humanized)
PassengerId
1                 3           Economy
2                 1       First class
3                 3           Economy
4                 1       First class
5                 3           Economy

In [11]:
#이번에는 Pclass가 아닌 새롭게 만든 Pclass(humanized) 컬럼으로 pivot_table을 만들어주세요. 최종적으로는 다음의 결과가 나와야 합니다.
from IPython.display import HTML
HTML(filename="html/table3.html")

In [12]:
# **** <문제7> ****
# pandas의 pivot_table을 활용하여 Pclass별 생존률을 출력합니다.
# 하지만 이번에는 Pclass 컬럼이 아닌 Pclass(humanized) 컬럼을 사용합니다.
# 이전에 비해서 훨씬 더 직관적으로 생존률을 확인할 수 있습니다.

pd.pivot_table(data=train, index="Pclass(humanized)", values="Survived")

                   Survived
Pclass(humanized)
Business           0.472826
Economy            0.242363
First class        0.629630

In [13]:
# **** <문제8> ****
# pandas의 pivot_table을 활용하여 Embarked 별 생존률을 출력합니다.
# 여기서도 Embarked 컬럼이 C, S, Q라는 다소 직관적이지 않은 값이 나옵니다.
# 그러므로 Embarked 컬럼의 값도 Pclass 처럼 직관적으로 바꿔주고 싶습니다.

pd.pivot_table(data=train, index='Embarked', values='Survived')

          Survived
Embarked
C         0.553571
Q         0.389610
S         0.336957

In [14]:
#Survived(humanized), Pclass(humanized)와 마찬가지로, Embarked 컬럼도 **Embarked(humanized)**라는 이름의 새로운 컬럼을 만들어주세요.
#이 컬럼에는 C, S, Q가 아닌 Cherbourg, Southampton, Queenstown이라는 값이 들어갑니다. 
#최종적으로는 다음의 결과가 나와야 합니다.
from IPython.display import HTML
HTML(filename="html/table3.html")

In [15]:
# **** <문제9> ****
# 먼저 Embarked 컬럼이 C인 승객을 색인합니다. 이후 Embarked(humanized)라는 이름의
# 새로운 컬럼을 만들어 여기에 "Cherbourg" 라는 값을 넣습니다.


# 비슷하게 Embarked 컬럼이 2인 승객을 찾아 Embarked(humanized)에 "Southampton" 이라는 값을 넣습니다.

# 비슷하게 Embarked 컬럼이 3인 승객을 찾아 Embarked(humanized)에 "Queenstown" 이라는 값을 넣습니다.


# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.


# Embarked 컬럼과 Embarked(humanized) 컬럼 두 개를 출력하여 비교합니다.

train['Embarked(humanized)'] = ''

Embarked_C = np.where(train['Embarked'] == 'S', 'Southampton', 'Queenstown')
train['Embarked(humanized)'] = np.where(train['Embarked'] == 'C', 'Cherbourg', Embarked_C)
train.loc[:,['Embarked', 'Embarked(humanized)']].head()

            Embarked Embarked(humanized)
PassengerId
1                  S         Southampton
2                  C           Cherbourg
3                  S         Southampton
4                  S         Southampton
5                  S         Southampton

In [16]:
# 그리고 마찬가지로 이번에도 Embarked가 아닌 새롭게 만든 Embarked(humanized) 컬럼으로 pivot_table을 만들어주세요. 
# 여기에는 Cherbourg, Southampton, 그리고 Queenstown 에 탑승한 승객의 생존률이 출력됩니다. 
# 최종적으로는 다음의 결과가 나와야 합니다.
from IPython.display import HTML
HTML(filename="html/table5.html")

In [17]:
# **** <문제10> ****
# pandas의 pivot_table을 활용하여 Embarked별 생존률을 출력합니다.
# 마찬가지로 Embarked 컬럼이 아닌 Embarked(humanized) 컬럼을 사용합니다.
# 이전에 비해서 훨씬 더 직관적으로 생존률을 확인할 수 있습니다.

pd.pivot_table(data=train, index='Embarked(humanized)', values='Survived')

                     Survived
Embarked(humanized)
Cherbourg            0.553571
Queenstown           0.405063
Southampton          0.336957

In [18]:
from IPython.display import HTML
HTML(filename="html/table6.html")

In [19]:
from IPython.display import HTML
HTML(filename="html/table7.html")

In [20]:
# **** <문제11> ****
# 먼저 Embarked 컬럼의 값이 C인 승객을 색인합니다. 결과적으로 Embarked가 C이면 True, 아니면 False인 리스트가 나옵니다.
# 이 결과를 Embarked(Cherbourg)라는 이름의 새로운 컬럼에 대입합니다.
train['Embarked(Cherbourg)'] = ''
temp_C = train['Embarked'] == 'C'
# 비슷한 방식으로 Embarked(Southampton)라는 이름의 새로운 컬럼을 추가합니다.
# 여기에는 Embarked 컬럼의 값이 S이면 True, 아니면 False가 들어갑니다.
train['Embarked(Southampton)'] = ''
temp_S = train['Embarked'] == 'S'
# 비슷한 방식으로 Embarked(Queenstown)이라는 이름의 새로운 컬럼을 추가합니다.
# 여기에는 Embarked 컬럼의 값이 Q이면 True, 아니면 False가 들어갑니다.
train['Embarked(Queenstown)'] = ''
temp_Q = train['Embarked'] == 'Q'
# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)
train['Embarked(Cherbourg)'] = temp_C
train['Embarked(Southampton)'] = temp_S
train['Embarked(Queenstown)'] = temp_Q
# Embarked 컬럼과 기타 연관 컬럼들을 출력하여 비교합니다.
train[["Embarked", "Embarked(humanized)", "Embarked(Cherbourg)", "Embarked(Southampton)", "Embarked(Queenstown)"]].head(10)

(891, 17)

,Embarked,Embarked(humanized),Embarked(Cherbourg),Embarked(Southampton),Embarked(Queenstown)
PassengerId,,,,,
1,S,Southampton,False,True,False
2,C,Cherbourg,True,False,False
3,S,Southampton,False,True,False
4,S,Southampton,False,True,False
5,S,Southampton,False,True,False
6,Q,Queenstown,False,False,True
7,S,Southampton,False,True,False
8,S,Southampton,False,True,False
9,S,Southampton,False,True,False
10,C,Cherbourg,True,False,False

In [21]:
# **** <문제12> ****
# Pclass의 One Hot Encoding도 Pclass와 비슷합니다.
# 먼저 Pclass 컬럼의 값이 1인 승객을 색인합니다. 결과적으로 Pclass가 1이면 True, 아니면 False인 리스트가 나옵니다.
# 이 결과를 Pclass(First Class)라는 이름의 새로운 컬럼에 대입합니다.
train['Pclass(First Class)'] = ''
temp_FC = train['Pclass'] == 1
# 비슷한 방식으로 Pclass(Business)라는 이름의 새로운 컬럼을 추가합니다.
# 여기에는 Pclass 컬럼의 값이 2이면 True, 아니면 False가 들어갑니다.
train['Pclass(Business)'] = ''
temp_BC = train['Pclass'] == 2
# 비슷한 방식으로 Pclass(Economy)라는 이름의 새로운 컬럼을 추가합니다.
# 여기에는 Pclass 컬럼의 값이 3이면 True, 아니면 False가 들어갑니다.
train['Pclass(Economy)'] = ''
temp_EC = train['Pclass'] == 3
# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)
train['Pclass(First Class)'] = temp_FC
train['Pclass(Business)'] = temp_BC
train['Pclass(Economy)'] = temp_EC
# Pclass 컬럼과 기타 연관 컬럼들을 출력하여 비교합니다.
train[["Pclass", "Pclass(humanized)", "Pclass(First Class)", "Pclass(Business)", "Pclass(Economy)"]].head(10)

(891, 20)

,Pclass,Pclass(humanized),Pclass(First Class),Pclass(Business),Pclass(Economy)
PassengerId,,,,,
1,3,Economy,False,False,True
2,1,First class,True,False,False
3,3,Economy,False,False,True
4,1,First class,True,False,False
5,3,Economy,False,False,True
6,3,Economy,False,False,True
7,1,First class,True,False,False
8,3,Economy,False,False,True
9,3,Economy,False,False,True
10,2,Business,False,True,False

In [22]:
# **** <문제13> ****
# 나이(Age) 컬럼에서 mean 함수를 통해 평균 나이를 구합니다.
# 평균 나이가 약 29.7세라는 것을 알 수 있습니다.
train['Age'].mean()

29.69911764705882

In [23]:
# **** <문제14> ****
# 나이(Age) 컬럼에서 std 함수를 통해 나이의 표준 편차를 구합니다.
# 나이의 분산이 약 14.52세라는 것을 알 수 있습니다.
train['Age'].std()

14.526497332334042

In [24]:
# **** <문제15> ****
# 나이(Age) 컬럼에서 min 함수를 통해 나이의 최소치를 구합니다.
# 타이타닉호에 탑승한 가장 어린 승객은 약 0.42세(생후 4개월 정도)라는 것을 알 수 있습니다.
train['Age'].min()

0.42

In [25]:
# **** <문제16> ****
#나이(Age) 컬럼에서 max 함수를 통해 나이의 최대치 구합니다.
# 타이타닉호에 탑승한 가장 나이가 많은 승객은 80세라는 것을 알 수 있습니다.
train['Age'].max()

80.0

In [26]:
# **** <문제17> ****
# 나이(Age) 컬럼에 대해 describe 함수를 사용합니다.
# 이 함수는 특정 컬럼의 평균, 분산, 최대치, 최소치와 같은 기초적인 통계치를 보여줍니다.
train['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [27]:
# **** <문제18> ****
# Pclass가 1등급인 승객만 색인해서 가져온 뒤, 이를 Pclass1이라는 변수에 할당합니다.
Pclass1 = train['Pclass'] == 1

# 1등급 승객의 평균 나이를 구합니다.
train.loc[Pclass1, 'Age'].mean()

38.233440860215055

In [28]:


# **** <문제19> ****
# Pclass가 2등급인 승객만 색인해서 가져온 뒤, 이를 Pclass2이라는 변수에 할당합니다.
Pclass2 = train['Pclass'] == 2
# 2등급 승객의 평균 나이를 구합니다.
train.loc[Pclass2, 'Age'].mean()

29.87763005780347

In [29]:
# **** <문제20> ****
# Pclass가 3등급인 승객만 색인해서 가져온 뒤, 이를 Pclass3이라는 변수에 할당합니다.
Pclass3 = train['Pclass'] == 3

# 3등급 승객의 평균 나이를 구합니다.
train.loc[Pclass3, 'Age'].mean()

25.14061971830986

In [30]:
# **** <문제21> ****
# 타이타닉 데이터를 Pclass 기준으로 그룹화합니다.
# 이렇게 하면 Pclass의 세 종류(1등급, 2등급, 3등급)마다 따로따로 연산을 할 수 있습니다.
# 이후 나이(Age) 컬럼의 평균(mean)을 구하면 1, 2, 3등급마다의 평균 나이가 나옵니다.

grouped = train['Age'].groupby(train['Pclass'])
grouped.mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [31]:
from IPython.display import HTML
HTML(filename="html/table8.html")

In [32]:
# **** <문제22> ****
# 나이가 15세 미만인 승객을 색인한 뒤, AgeType이라는 새로운 컬럼에 "Young"이라는 값을 넣습니다.
train['AgeType'] = ''
age_type_15 = np.where(train['Age'] < 15, 'Young', 'Medium')
# 비슷하게 나이가 15세 이상 30세 미만인 승객의 AgeType에는 "Medium"이라는 값을 넣습니다.
train['AgeType'] = np.where(train['Age'] >= 30, 'Old', age_type_15)

# 비슷하겍 30세 이상인 승객의 AgeType에는 "Old"이라는 값을 넣습니다.


# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# 나이(Age) 컬럼과 AgeType 컬럼을 출력하여 비교합니다.
train[["Age", "AgeType"]].head(10)

(891, 21)

              Age AgeType
PassengerId
1            22.0  Medium
2            38.0     Old
3            26.0  Medium
4            35.0     Old
5            35.0     Old
6             NaN  Medium
7            54.0     Old
8             2.0   Young
9            27.0  Medium
10           14.0   Young

In [33]:
# **** <문제23> ****
# 타이타닉 데이터를 AgeType 기준으로 그룹화합니다.
# 이후 생존 여부(Survived) 컬럼의 평균(mean)을 구하면 Young, Medium, Old 마다의 평균 생존률이 나옵니다.

train['Survived'].groupby(train['AgeType']).mean()

AgeType
Medium    0.337474
Old       0.406061
Young     0.576923
Name: Survived, dtype: float64

In [34]:
# **** <문제24> ****
# isnull 함수를 활용해 나이 컬럼이 비어있는 승객만 색인합니다.
# 이 데이터에서 AgeBlank라는 새로운 컬럼을 만든 뒤, 여기에 "Blank"라는 값을 넣습니다.

# 비슷한 방식으로 notnull 함수를 활용하여 AgeBlank 컬럼에 "Not Blank"라는 값을 넣습니다.
train['AgeBlank'] = np.where(train['Age'].isnull() == True, 'Blank', 'Not Blank')

# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# 나이(Age) 컬럼과 AgeBlank 컬럼을 출력하여 비교합니다.
train[["Age", "AgeBlank"]].head(10)

(891, 22)

              Age   AgeBlank
PassengerId
1            22.0  Not Blank
2            38.0  Not Blank
3            26.0  Not Blank
4            35.0  Not Blank
5            35.0  Not Blank
6             NaN      Blank
7            54.0  Not Blank
8             2.0  Not Blank
9            27.0  Not Blank
10           14.0  Not Blank

In [35]:
# **** <문제25> ****
# 타이타닉 데이터를 AgeBlank 기준으로 그룹화합니다.
# 이후 생존 여부(Survived) 컬럼의 평균(mean)을 구하면 Blank, Not Blank 마다의 평균 생존률이 나옵니다.

grouped = train['Survived'].groupby(train['AgeBlank'])
grouped.mean()

AgeBlank
Blank        0.293785
Not Blank    0.406162
Name: Survived, dtype: float64

In [36]:
from IPython.display import HTML
HTML(filename="html/table9.html")

In [37]:
# **** <문제26> ****
# 타이타닉 데이터를 Pclass 기준으로 그룹화한 뒤, 나이(Age) 컬럼의 평균을 구합니다.
# 이 결과를 mean_age_by_pclass 라는 변수에 할당합니다.

mean_age_by_pclass = train['Age'].groupby(train['Pclass'])
mean_age_by_pclass.mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [38]:
# **** <문제27> ****
# Age 컬럼에 바로 값을 채워주는 것도 좋지만, 가능한 원본은 유지한 채 사본에다가 작업하는 것을 추천합니다.
# 그러므로 Age(fill) 이라는 새로운 컬럼을 만든 뒤, 이 컬럼의 빈 값을 채워줄 것입니다.
train['Age(fill)'] = train['Age']
# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# 객실 등급(Pclass), 나이(Age), 그리고 Age(fill) 컬럼을 출력하여 비교합니다.
train[["Pclass","Age", "Age(fill)"]].head(30)

(891, 23)

             Pclass   Age  Age(fill)
PassengerId
1                 3  22.0       22.0
2                 1  38.0       38.0
3                 3  26.0       26.0
4                 1  35.0       35.0
5                 3  35.0       35.0
6                 3   NaN        NaN
7                 1  54.0       54.0
8                 3   2.0        2.0
9                 3  27.0       27.0
10                2  14.0       14.0
11                3   4.0        4.0
12                1  58.0       58.0
13                3  20.0       20.0
14                3  39.0       39.0
15                3  14.0       14.0
16                2  55.0       55.0
17                3   2.0        2.0
18                2   NaN        NaN
19                3  31.0       31.0
20                3   NaN        NaN
21                2  35.0       35.0
22                2  34.0       34.0
23                3  15.0       15.0
24                1  28.0       28.0
25                3   8.0        8.0
26                3  38.0       38.0
27                3   NaN        NaN
28                1  19.0       19.0
29                3   NaN        NaN
30                3   NaN        NaN

In [39]:
# **** <문제28> ****
# 객실 등급(Pclass)이 1등급이고 나이(Age) 컬럼값이 비어있는 승객을 색인합니다.
# 이 승객의 Age(fill)에 평균 1등급 승객의 평균 나이를 채워넣습니다.

# 비슷한 원리로 객실 등급(Pclass)이 2등급인 승객도 비슷한 방식으로 빈 나이값을 채워넣습니다.

# 객실 등급(Pclass)이 3등급인 승객도 비슷한 방식으로 빈 나이값을 채워넣습니다.

# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

train['Age(fill)'] = train['Age(fill)'].fillna(value=train['Age(fill)'].mean())
# 객실 등급(Pclass), 나이(Age), 그리고 Age(fill) 컬럼을 출력하여 비교합니다.
train[["Pclass","Age", "Age(fill)"]].head(30)

(891, 23)

             Pclass   Age  Age(fill)
PassengerId
1                 3  22.0  22.000000
2                 1  38.0  38.000000
3                 3  26.0  26.000000
4                 1  35.0  35.000000
5                 3  35.0  35.000000
6                 3   NaN  29.699118
7                 1  54.0  54.000000
8                 3   2.0   2.000000
9                 3  27.0  27.000000
10                2  14.0  14.000000
11                3   4.0   4.000000
12                1  58.0  58.000000
13                3  20.0  20.000000
14                3  39.0  39.000000
15                3  14.0  14.000000
16                2  55.0  55.000000
17                3   2.0   2.000000
18                2   NaN  29.699118
19                3  31.0  31.000000
20                3   NaN  29.699118
21                2  35.0  35.000000
22                2  34.0  34.000000
23                3  15.0  15.000000
24                1  28.0  28.000000
25                3   8.0   8.000000
26                3  38.0  38.000000
27                3   NaN  29.699118
28                1  19.0  19.000000
29                3   NaN  29.699118
30                3   NaN  29.699118

In [40]:
# **** <문제29> ****
# 나이(Age) 컬럼값이 비어있는 승객만 가져온 뒤,
# 이 승객의 객실 등급(Pclass), 나이(Age), 그리고 Age(fill) 컬럼을 출력하여 비교합니다.

train.loc[train['Age'].isin(['NaN']), ["Pclass","Age", "Age(fill)"]].head(10)

             Pclass  Age  Age(fill)
PassengerId
6                 3  NaN  29.699118
18                2  NaN  29.699118
20                3  NaN  29.699118
27                3  NaN  29.699118
29                3  NaN  29.699118
30                3  NaN  29.699118
32                1  NaN  29.699118
33                3  NaN  29.699118
37                3  NaN  29.699118
43                3  NaN  29.699118

In [41]:
from IPython.display import HTML
HTML(filename="html/table10.html")

In [42]:
from IPython.display import HTML
HTML(filename="html/table11.html")

In [43]:
# **** <문제30> ****
# SibSp가 0이고 Parch가 0이면 True, 아니면 False인 리스트를 생성합니다.
# 이 리스트를 Single이라는 이름의 새로운 컬럼에 집어넣습니다.
train['Single'] = ((train['SibSp'] == 0) & (train['Parch'] == 0))
# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# SibSp, Parch, 그리고 Single을 출력하여 비교합니다.
train[["SibSp", "Parch", "Single"]].head()

(891, 24)

             SibSp  Parch  Single
PassengerId
1                1      0   False
2                1      0   False
3                0      0    True
4                1      0   False
5                0      0    True

In [44]:
# **** <문제31> ****
# pandas의 pivot_table을 활용하여 Single 여부에 따른 생존률을 출력합니다.
# Single 컬럼의 값이 True일 경우의 생존률과, False일 경우의 생존률을 비교할 수 있습니다.

pd.pivot_table(data=train, index='Single', values='Survived')

        Survived
Single
False   0.505650
True    0.303538

In [45]:
from IPython.display import HTML
HTML(filename="html/table12.html")

In [46]:
from IPython.display import HTML
HTML(filename="html/table13.html")

In [47]:
# **** <문제32> ****
# 형제, 자매, 배우자(SibSp) 컬럼과 부모 자식(Parch) 컬럼을 더해서 가족 수(FamilySize) 컬럼을 만듭니다.
# 또한 가족 수에 나 자신을 포함하기 위해서 언제나 +1을 해줍니다.
train['FamilySize'] = train['SibSp'] + train['Parch'] + 1
# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# SibSp, Parch, FamilySize를 출력하여 비교합니다.
train[["SibSp", "Parch", "FamilySize"]].head(10)

(891, 25)

             SibSp  Parch  FamilySize
PassengerId
1                1      0           2
2                1      0           2
3                0      0           1
4                1      0           2
5                0      0           1
6                0      0           1
7                0      0           1
8                3      1           5
9                0      2           3
10               1      0           2

In [48]:
# **** <문제33> ****
# pandas의 pivot_table을 활용하여 FamilySize에 따른 생존률을 출력합니다.
# 가족 수가 1명부터 11명까지 각각의 생존률을 비교할 수 있습니다.

pd.pivot_table(data=train, index='FamilySize', values='Survived')

            Survived
FamilySize
1           0.303538
2           0.552795
3           0.578431
4           0.724138
5           0.200000
6           0.136364
7           0.333333
8           0.000000
11          0.000000

In [49]:
from IPython.display import HTML
HTML(filename="html/table14.html")

In [50]:
from IPython.display import HTML
HTML(filename="html/table15.html")

In [51]:
# **** <문제34> ****
# 가족 수(FamilSize)가 1인 승객을 가져와서, FamilyType 컬럼에 Single 이라는 값을 넣어줍니다.

# 가족 수(FamilSize)가 2 이상 5 미만인 승객을 가져와서, FamilyType 컬럼에 Nuclear(핵가족) 이라는 값을 넣어줍니다.

# 가족 수(FamilSize)가 5 이상인 승객을 가져와서, FamilyType 컬럼에 Big(대가족) 이라는 값을 넣어줍니다.

# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

type_Big = np.where(((train['FamilySize'] >= 2) & (train['FamilySize'] < 5)), 'Nuclear', 'Big')
train['FamilyType'] = np.where(train['FamilySize'] == 1, 'Single', type_Big)

# train 데이터의 상위 10개를 띄우되, FamilySize와 FamilyType 컬럼만 출력합니다.
train[["FamilySize", "FamilyType"]].head(10)

(891, 25)

             FamilySize FamilyType
PassengerId
1                     2    Nuclear
2                     2    Nuclear
3                     1     Single
4                     2    Nuclear
5                     1     Single
6                     1     Single
7                     1     Single
8                     5        Big
9                     3    Nuclear
10                    2    Nuclear

In [52]:
# **** <문제35> ****
# pivot_table을 통해 가족 형태(FamilyType)의 변화에 따른 생존률을 출력합니다.

pd.pivot_table(data=train, index='FamilyType', values='Survived')

            Survived
FamilyType
Big         0.161290
Nuclear     0.578767
Single      0.303538

In [53]:
from IPython.display import HTML
HTML(filename="html/table16.html")

In [54]:
# **** <문제36> ****
# 가족 수(FamilySize) 컬럼을 활용해 세 가지 구역을 나타내는 세 개의 새로운 컬럼을 만듭니다.
# 먼저 가족 수가 1명일 경우 Single 컬럼의 값에 True를, 1명이 아닐 경우 False를 대입합니다.
train['FamilyType(Single)'] = train['FamilySize'] == 1
# 이후 가족 수가 2에서 4명 사이일 경우 Nuclear 컬럼의 값에 True를, 그렇지 않을 경우 False를 대입합니다.
train['FamilyType(Nuclear)'] = ((train['FamilySize'] >= 2) & (train['FamilySize'] <= 4))
# 마지막으로 가족 수가 5명 이상일 경우 Big 컬럼의 값에 True를, 그렇지 않을 경우 False를 대입합니다.
train['FamilyType(Big)'] = train['FamilySize'] >= 5
# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# train 데이터의 상위 10개를 띄우되,
# FamilySize, FamilyType(Single), FamilyType(Nuclear), FamilyType(Big) 컬럼만 출력합니다.
train[["FamilySize", "FamilyType(Single)", "FamilyType(Nuclear)", "FamilyType(Big)"]].head(10)

(891, 29)

,FamilySize,FamilyType(Single),FamilyType(Nuclear),FamilyType(Big)
PassengerId,,,,
1,2,False,True,False
2,2,False,True,False
3,1,True,False,False
4,2,False,True,False
5,1,True,False,False
6,1,True,False,False
7,1,True,False,False
8,5,False,False,True
9,3,False,True,False
10,2,False,True,False

In [55]:
# **** <문제37> ****
# 가족 형태(FamilySize)가 Single이면 True, 아니면 False인 리스트를 가져옵니다.
# 이후 이 리스트를 FamilyType(Single)이라는 새로운 컬럼에 대입합니다.

# 비슷한 방식으로 FamilyType(Nuclear)라는 새로운 컬럼을 만듭니다.

# 비슷한 방식으로 FamilyType(Big)이라는 새로운 컬럼을 만듭니다.

# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# FamilySize, FamilyType(Single), FamilyType(Nuclear), FamilyType(Big) 컬럼만 출력합니다.
train[["FamilySize", "FamilyType(Single)", "FamilyType(Nuclear)", "FamilyType(Big)"]].head(10)

(891, 29)

,FamilySize,FamilyType(Single),FamilyType(Nuclear),FamilyType(Big)
PassengerId,,,,
1,2,False,True,False
2,2,False,True,False
3,1,True,False,False
4,2,False,True,False
5,1,True,False,False
6,1,True,False,False
7,1,True,False,False
8,5,False,False,True
9,3,False,True,False
10,2,False,True,False

In [56]:
HTML(filename="html/table17.html")

In [57]:
HTML(filename="html/table18.html")

In [58]:
# get_title이라는 이름의 함수를 정의합니다. 이 함수는 name이라는 변수를 인자로 받습니다.
# 이 함수는 이름을 받았을 때 이름에서 타이틀을 반환해줍니다.
# 가령 name에 "Braund, Mr. Owen Harris"가 들어오면 최종 결과는 Mr를 반환해줍니다.
def get_title(name):
    # 먼저 name을 , 을 기준으로 쪼갭니다. 쪼갠 결과는 0) Braund와 1) Mr. Owen Harris가 됩니다.
    # 여기서 1)번을 가져온 뒤 다시 . 을 기준으로 쪼갭니다. 쪼갠 결과는 0) Mr와 1) Owen Harris가 됩니다.
    # 여기서 0)번을 반환합니다. 최종적으로는 Mr를 반환하게 됩니다.
    return name.split(", ")[1].split('. ')[0]

# 모든 Name 컬럼 데이터에 get_title 함수를 적용한 뒤 그 결과를 Title이라는 이름의 새로운 컬럼에 대입합니다.
train["Title"] = train["Name"].apply(get_title)

# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# 이름(Name) 컬럼과 호칭(Title) 컬럼만을 출력합니다.
train[["Name", "Title"]].head(10)

(891, 30)

                                                          Name   Title
PassengerId
1                                      Braund, Mr. Owen Harris      Mr
2            Cumings, Mrs. John Bradley (Florence Briggs Th...     Mrs
3                                       Heikkinen, Miss. Laina    Miss
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)     Mrs
5                                     Allen, Mr. William Henry      Mr
6                                             Moran, Mr. James      Mr
7                                      McCarthy, Mr. Timothy J      Mr
8                               Palsson, Master. Gosta Leonard  Master
9            Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)     Mrs
10                         Nasser, Mrs. Nicholas (Adele Achem)     Mrs

In [59]:
# **** <문제38> ****
# pivot_table을 통해 호칭(Title)별 생존률을 출력합니다.
# Mr, Mrs, Master, Miss 등의 호칭별 생존률을 확인할 수 있습니다.

pd.pivot_table(data=train, index='Title', values='Survived',)

              Survived
Title
Capt          0.000000
Col           0.500000
Don           0.000000
Dr            0.428571
Jonkheer      0.000000
Lady          1.000000
Major         0.500000
Master        0.575000
Miss          0.697802
Mlle          1.000000
Mme           1.000000
Mr            0.156673
Mrs           0.792000
Ms            1.000000
Rev           0.000000
Sir           1.000000
the Countess  1.000000

In [60]:
# crosstab을 활용하여 각 호칭(Title)별 생존자의 총 인원수와 사망자의 총 인원수를 출력합니다.
pd.crosstab(train["Title"], train["Survived"], margins=True)

Survived        0    1  All
Title
Capt            1    0    1
Col             1    1    2
Don             1    0    1
Dr              4    3    7
Jonkheer        1    0    1
Lady            0    1    1
Major           1    1    2
Master         17   23   40
Miss           55  127  182
Mlle            0    2    2
Mme             0    1    1
Mr            436   81  517
Mrs            26   99  125
Ms              0    1    1
Rev             6    0    6
Sir             0    1    1
the Countess    0    1    1
All           549  342  891

In [61]:
HTML(filename="html/table19.html")

In [62]:
HTML(filename="html/table20.html")

In [63]:
# 이번에는 get_cleaned_title 이름의 함수를 정의합니다.
# 이 함수에서는 Mr, Mrs, Miss, Master 가 아닌 호칭은 전부 Other라고 반환합니다.
def get_cleaned_title(name):
    # 먼저 name을 , 을 기준으로 쪼갭니다. 쪼갠 결과는 0) Braund와 1) Mr. Owen Harris가 됩니다.
    # 여기서 1)번을 가져온 뒤 다시 . 을 기준으로 쪼갭니다. 쪼갠 결과는 0) Mr와 1) Owen Harris가 됩니다.
    # 여기서 0)번을 반환합니다. 최종적으로는 Mr를 반환하게 됩니다.
    # 해당 값을 title이라는 이름의 변수에 할당합니다.
    title = name.split(", ")[1].split('. ')[0]
    
    # title이라는 변수에 들어간 값이 Mr, Mrs, Miss, Master중에 하나에 해당되면
    # title 자기 자신을 반환합니다.
    if title in ["Mr", "Mrs", "Miss", "Master"]:
        return title
    # 그렇지 않다면 "Others"라는 값을 반환합니다.
    else:
        return "Others"

# 모든 Name 컬럼 데이터에 get_cleaned_title 함수를 적용한 뒤
# 그 결과를 Title(Clean)이라는 이름의 새로운 컬럼에 대입합니다.
train["Title(Clean)"] = train["Name"].apply(get_cleaned_title)

# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# 이름(Name) 컬럼과 Title 컬럼, 그리고 Title(Clean) 컬럼만을 출력합니다.
# 다만 이번에는 head가 아니라 tail을 활용해 마지막 다섯 컬럼만 출력합니다.
train[["Name", "Title", "Title(Clean)"]].tail()

(891, 31)

                                                 Name Title Title(Clean)
PassengerId
887                             Montvila, Rev. Juozas   Rev       Others
888                      Graham, Miss. Margaret Edith  Miss         Miss
889          Johnston, Miss. Catherine Helen "Carrie"  Miss         Miss
890                             Behr, Mr. Karl Howell    Mr           Mr
891                               Dooley, Mr. Patrick    Mr           Mr

In [64]:
# **** <문제39> ****
# pivot_table을 통해 정리한 호칭별 생존률을 출력합니다.
# Mr, Mrs, Master, Miss, Others별 생존률을 확인할 수 있습니다.

pd.pivot_table(data=train, index='Title(Clean)', values="Survived")

              Survived
Title(Clean)
Master        0.575000
Miss          0.697802
Mr            0.156673
Mrs           0.792000
Others        0.444444

In [65]:
HTML(filename="html/table21.html")

In [66]:
HTML(filename="html/table22.html")

In [67]:
# **** <문제40> ****
# 호칭(Title)이 Mr인 데이터를 가져와서, 결혼 유무(Married)라는 새로운 컬럼에 True라는 값을 대입합니다.
Mr_true = train['Title'] == 'Mr'
train['Married'] = Mr_true
# 비슷하게 호칭(Title)이 Mrs인 데이터를 가져와서 결혼 유무(Married) 컬럼에 True라는 값을 대입합니다.
Mrs_true = train['Title'] == 'Mrs'
train['Married'] = (Mr_true | Mrs_true)
# 호칭(Title)이 Master인 데이터를 가져와서 결혼 유무(Married) 컬럼에 False라는 값을 대입합니다.


# 호칭(Title)이 Miss인 데이터를 가져와서 결혼 유무(Married) 컬럼에 False라는 값을 대입합니다.


# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# 이름(Name) 컬럼과 호칭(Title) 컬럼, 그리고 결혼 유무(Married) 컬럼을 출력합니다.
train[["Name", "Title", "Married"]].head(10)

(891, 32)

,Name,Title,Married
PassengerId,,,
1,"Braund, Mr. Owen Harris",Mr,True
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Mrs,True
3,"Heikkinen, Miss. Laina",Miss,False
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Mrs,True
5,"Allen, Mr. William Henry",Mr,True
6,"Moran, Mr. James",Mr,True
7,"McCarthy, Mr. Timothy J",Mr,True
8,"Palsson, Master. Gosta Leonard",Master,False
9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",Mrs,True
10,"Nasser, Mrs. Nicholas (Adele Achem)",Mrs,True

In [68]:
# **** <문제41> ****
# 호칭(Title)이 Mr이거나 Mrs인 데이터를 가져옵니다.
# 이후 결혼 유무(Married)라는 새로운 컬럼에 True라는 값을 대입합니다.
train['Married'] = ((train['Title'] == 'Mr') | (train['Title'] == 'Mrs'))

# 비슷하게 호칭(Title)이 Master이거나 Miss인 데이터를 가져옵니다.
# 마찬가지로 결혼 유무(Married)라는 컬럼에 False라는 값을 대입합니다.


# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# 이름(Name) 컬럼과 호칭(Title) 컬럼, 그리고 결혼 유무(Married) 컬럼을 출력합니다.
train[["Name", "Title", "Married"]].head(10)

(891, 32)

,Name,Title,Married
PassengerId,,,
1,"Braund, Mr. Owen Harris",Mr,True
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Mrs,True
3,"Heikkinen, Miss. Laina",Miss,False
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Mrs,True
5,"Allen, Mr. William Henry",Mr,True
6,"Moran, Mr. James",Mr,True
7,"McCarthy, Mr. Timothy J",Mr,True
8,"Palsson, Master. Gosta Leonard",Master,False
9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",Mrs,True
10,"Nasser, Mrs. Nicholas (Adele Achem)",Mrs,True

In [69]:
# **** <문제42> ****
# pivot_table을 통해 결혼 유무(Married)별 따른 생존률을 출력합니다.
# 결혼을 한 승객(True)와 하지 않은 승객(False)간의 생존률의 차이를 볼 수 있습니다.

pd.pivot_table(data=train, index='Married', values='Survived')

         Survived
Married
False    0.650602
True     0.280374

In [70]:
# **** <문제43> ****
# 이름(Name) 컬럼에서 Graham이라는 성이 포함된 승객만을 색인합니다.
# 이 결과를 graham이라는 이름의 변수에 저장한 후 출력합니다.
graham = train.Name.str.contains('^Graham')
train.loc[graham, :]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,...,Age(fill),Single,FamilySize,FamilyType,FamilyType(Single),FamilyType(Nuclear),FamilyType(Big),Title,Title(Clean),Married
PassengerId,,,,,,,,,,,,,,,,,,,,,
269,1,1,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0,1,PC 17582,153.4625,C125,...,58.0,False,2,Nuclear,False,True,False,Mrs,Mrs,True
333,0,1,"Graham, Mr. George Edward",male,38.0,0,1,PC 17582,153.4625,C91,...,38.0,False,2,Nuclear,False,True,False,Mr,Mr,True
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,...,19.0,True,1,Single,True,False,False,Miss,Miss,False

In [71]:
# **** <문제44> ****
# graham이라는 변수에 저장된 데이터에서
# 이름(Name), 형제, 자매, 배우자(SibSp), 부모, 자식(Parch), 그리고 가족 수(FamilySize)를 출력합니다.

train.loc[graham, ['Name', 'SibSp', 'Parch', 'FamilySize']]

,Name,SibSp,Parch,FamilySize
PassengerId,,,,
269,"Graham, Mrs. William Thompson (Edith Junkins)",0,1,2
333,"Graham, Mr. George Edward",0,1,2
888,"Graham, Miss. Margaret Edith",0,0,1

In [72]:
HTML(filename="html/table23.html")

In [73]:
# get_surname이라는 이름의 함수를 만듭니다. 이 함수에는 name이라는 이름의 변수가 인자로 들어갑니다.
# 이 함수는 이름을 받았을 때 이름에서 타이틀을 반환해줍니다.
# 가령 name에 "Braund, Mr. Owen Harris"가 들어오면 최종 결과는 Braund를 반환해줍니다.
def get_surname(name):
    # 먼저 name을 , 을 기준으로 쪼갭니다. 쪼갠 결과는 0) Braund와 1) Mr. Owen Harris가 됩니다.
    # 여기서 0)번을 반환합니다. 최종적으로는 Braund를 반환하게 됩니다.
    # 해당 값을 surname이라는 이름의 변수에 할당합니다.
    surname = name.split(", ")[0]
    
    # surname을 반환합니다.
    return surname

# 모든 Name 컬럼 데이터에 get_surname 함수를 적용한 뒤
# 그 결과를 Surname이라는 이름의 새로운 컬럼에 대입합니다.
train["Surname"] = train["Name"].apply(get_surname)

# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# 이름(Name) 컬럼과 성(Surname) 컬럼만을 출력합니다.
train[["Name", "Surname"]].head()

(891, 33)

                                                          Name    Surname
PassengerId
1                                      Braund, Mr. Owen Harris     Braund
2            Cumings, Mrs. John Bradley (Florence Briggs Th...    Cumings
3                                       Heikkinen, Miss. Laina  Heikkinen
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)   Futrelle
5                                     Allen, Mr. William Henry      Allen

In [74]:
# **** <문제45> ****
# 성(Surname)과 가족 수(FamilySize)를 앞뒤로 붙입니다.
# 다만 문자열(str)과 정수형(int)는 덧셈이 되지 않기 때문에,
# 정수형에 해당하는 가족 수(FamilySize) 컬럼을 .astype 함수를 이용하여 문자열로 변환합니다.
# 그리고 덧셈의 결과를 가족 아이디(FamilyID)라는 이름의 컬럼에 할당합니다.
train['FamilySize'] = train['FamilySize'].astype(str)
train['FamilyID'] = train['Surname'] + train['FamilySize']
# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# 이름(Name) 컬럼과 성(Surname) 컬럼, 가족 수(FamilySize) 컬럼, 그리고 가족 아이디(FamilyID) 컬럼을 출력합니다.
train[["Name", "Surname", "FamilySize", "FamilyID"]].head()

(891, 34)

,Name,Surname,FamilySize,FamilyID
PassengerId,,,,
1,"Braund, Mr. Owen Harris",Braund,2,Braund2
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Cumings,2,Cumings2
3,"Heikkinen, Miss. Laina",Heikkinen,1,Heikkinen1
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Futrelle,2,Futrelle2
5,"Allen, Mr. William Henry",Allen,1,Allen1

In [75]:
HTML(filename="html/table24.html")

In [76]:
# **** <문제46> ****
# 가족 아이디(FamilyID) 컬럼에서 중복을 제거합니다.
# 그리고 그 결과를 family_ids라는 이름의 변수에 할당합니다.
family_ids = train['FamilyID'].unique()


# family_ids 변수에 할당된 데이터의 갯수를 출력합니다.


# family_ids 변수에 할당된 리스트의 상위 10개만을 출력합니다.
family_ids[0:10]

array(['Braund2', 'Cumings2', 'Heikkinen1', 'Futrelle2', 'Allen1',
       'Moran1', 'McCarthy1', 'Palsson5', 'Johnson3', 'Nasser2'],
      dtype=object)

In [77]:
# family_ids 리스트 안에 있는 모든 값을 반복문을 통해 꺼내옵니다.
# 꺼내온 값을 family_id라는 이름의 변수에 할당합니다.
for family_id in family_ids:
    # 가족 아이디(FamilyID) 컬럼값이 family_id 변수에 할당된 값과 일치하면 True, 그렇지 않으면 False를 반환합니다.
    # 그 결과를 family_id 변수에 할당된 값을 이름으로 하는 새로운 컬럼에 추가합니다.

    # 가령 family_id 변수에 Braund2가 할당되어 있을 경우,
    # 가족 아이디(FamilyID) 가 Braund2인 경우에는 True, 아니면 False를 반환하는 리스트를 만들고
    # 그 결과를 Braund2 이름의 새로운 컬럼에 할당합니다.
    train[family_id] = train["FamilyID"] == family_id
    
# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.
print(train.shape)

# train 데이터의 상위 5개를 출력합니다.
train.head()

(891, 735)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,...,Potter2,Shelley2,Markun1,Dahlberg1,Banfield1,Sutehall1,Montvila1,Graham1,Behr1,Dooley1
PassengerId,,,,,,,,,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,...,False,False,False,False,False,False,False,False,False,False
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,...,False,False,False,False,False,False,False,False,False,False
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,...,False,False,False,False,False,False,False,False,False,False
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,...,False,False,False,False,False,False,False,False,False,False
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,...,False,False,False,False,False,False,False,False,False,False

In [78]:
# **** <문제47> ****
# pandas의 get_dummies를 활용합니다.
# 이 함수를 사용하면 가족 아이디(FamilyID)에 있는 모든 값을 자동으로 One Hot Encoding 해줍니다.
family_ids = pd.get_dummies(train['FamilyID'])

# family_ids 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.



# family_ids 데이터의 상위 5개를 출력합니다.
family_ids.head()

,Abbing1,Abbott3,Abelson2,Adahl1,Adams1,Ahlin2,Aks2,Albimona1,Alexander1,Alhomaki1,...,Yousseff1,Yrois1,Zabour2,Zimmerman1,de Messemaeker2,de Mulder1,de Pelsmaeker1,del Carlo2,van Billiard3,van Melkebeke1
PassengerId,,,,,,,,,,,,,,,,,,,,,
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
5,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [79]:
# **** <문제48> ****
# .concat 함수를 사용하여 train 데이터와 family_ids 데이터를 하나로 합칩니다.
# 여기서 axis=0을 주면 두 개의 데이터를 위-아래로 합치고, axis=1을 주면 두 개의 데이터를 왼쪽-오른쪽으로 합칩니다.
# 그 결과를 다시 train 변수에 할당합니다.
train = pd.concat([train, family_ids], axis=1)

# train 변수에 할당된 데이터의 행렬 사이즈를 출력합니다.
# 출력은 (row, column) 으로 표시됩니다.



# train 데이터의 상위 5개를 출력합니다.
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,...,Yousseff1,Yrois1,Zabour2,Zimmerman1,de Messemaeker2,de Mulder1,de Pelsmaeker1,del Carlo2,van Billiard3,van Melkebeke1
PassengerId,,,,,,,,,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,...,0,0,0,0,0,0,0,0,0,0
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,...,0,0,0,0,0,0,0,0,0,0
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,...,0,0,0,0,0,0,0,0,0,0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,...,0,0,0,0,0,0,0,0,0,0
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,...,0,0,0,0,0,0,0,0,0,0